package lolthx.baidu.webpage;

import java.net.URLEncoder;
import java.text.MessageFormat;
import java.text.ParseException;

import org.apache.commons.lang3.time.DateUtils;

import lakenono.base.Producer;
import lakenono.base.Task;

public class BaiduWebSiteProducer extends Producer {

	private static final String BAIDU_WEB_SITE_URL = "https://www.baidu.com/s"+
			"?wd={0}"+
			"&pn=750"+
			"&ie=utf-8"+
			"&gpc=stf%3D{1}%2C{2}|stftype%3D2"+
			"&tfflag=1";
	
	private String city;
	private String keyword;
	
	public BaiduWebSiteProducer(String projectName,String city,String keyword) {
		super(projectName);
		this.city = city;
		this.keyword = keyword;
	}

	@Override
	public String getQueueName() {
		return "baidu_web_site_list";
	}

	@Override
	protected int parse() throws Exception {
		return 1;
	}

	@Override
	protected Task buildTask(String url) {
		Task buildTask = super.buildTask(url);
		buildTask.setExtra(city + ":" + keyword);
		try {
			buildTask.setStartDate(DateUtils.parseDate("20140831", "yyyyMMdd"));
			buildTask.setEndDate(DateUtils.parseDate("20150831", "yyyyMMdd"));
		} catch (ParseException e) {
			e.printStackTrace();
		}
		return buildTask;
	}
	
	@Override
	protected String buildUrl(int pageNum) throws Exception {
		String str0 = URLEncoder.encode(keyword, "utf-8");
		return MessageFormat.format(BAIDU_WEB_SITE_URL, 	str0);
	}
	
	public static void main(String args[]){
		
		/** 市树市花
		String projectName = "市树市花";
		String[] citys = {
				"北京","北京","北京","北京","天津","天津","石家庄","石家庄","唐山","唐山",
				"邯郸","邯郸","邯郸","保定","保定","沧州","沧州","太原","太原",
				"运城","运城","呼和浩特","呼和浩特","包头","包头","沈阳","沈阳",
				"大连","大连","大连","鞍山","鞍山","鞍山","长春","长春","吉林","吉林",
				"哈尔滨","哈尔滨 ","大庆","大庆","西安","西安","西安","咸阳","咸阳",
				"咸阳","咸阳","渭南","渭南","兰州","兰州","银川","银川",
				"西宁","西宁","乌鲁木齐","乌鲁木齐","重庆","重庆","成都","成都",
				"贵阳","贵阳","贵阳","贵阳","遵义","遵义","昆明","昆明","拉萨","拉萨",
				"拉萨","拉萨","上海","上海","南京","南京","无锡","无锡",
				"无锡","徐州","徐州","常州","常州","苏州","苏州",
				"南通","南通","淮安","淮安","盐城","盐城","盐城","盐城",
				"扬州","扬州","扬州","镇江","镇江","泰州","泰州","宿迁市","宿迁市",
				"台州","台州","杭州","杭州","宁波","宁波","温州","温州",
				"嘉兴","嘉兴","嘉兴","绍兴","绍兴","金华","金华","湖州","湖州",
				"合肥","合肥","合肥","合肥","安庆","安庆","福州","福州","厦门","厦门",
				"泉州","泉州","漳州","漳州","漳州","漳州","南昌","南昌",
				"南昌","南昌","九江","九江","上饶","上饶","吉安","吉安",
				"赣州","赣州","济南","济南","青岛","青岛","青岛","青岛","淄博","淄博","淄博","淄博",
				"烟台","烟台","菏泽","菏泽","威海","威海","济宁","济宁","济宁",
				"泰安","泰安","德州","德州","潍坊","潍坊","临沂","临沂",
				"郑州","郑州","洛阳","新乡","新乡","焦作","焦作",
				"南阳","武汉","武汉","襄樊","襄樊","宜昌","宜昌",
				"长沙","长沙","衡阳","衡阳","衡阳","岳阳","岳阳","常德","常德",
				"广州","广州","深圳","深圳","深圳","深圳",
				"珠海","珠海","珠海","佛山","佛山","江门","江门","江门",
				"湛江","惠州","惠州","惠州","东莞","东莞","茂名",
				"南宁","南宁","南宁","桂林","桂林","海口","海口","海口"
		};
		String[] keywords = {
				"北京 市树 侧柏","北京 市花 月季","北京 市树 国槐","北京 市花 菊花","天津 市树 绒毛白蜡","天津 市花 月季","石家庄 市树 国槐","石家庄 市花 月季","唐山 市树 国槐","唐山 市花 月季",
				"邯郸 市树 国槐","邯郸 市花 月季","邯郸 市树 法桐","保定 市树 国槐","保定 市花 兰花","沧州 市树 国槐","沧州 市花 月季","太原 市树 国槐","太原 市花 菊花",
				"运城 市树 国槐","运城 市花 月季","呼和浩特 市树 油松","呼和浩特 市花 丁香","包头 市树 云杉","包头 市花 小丽花","沈阳 市树 黑松","沈阳 市花 玫瑰",
				"大连 市树 龙柏","大连 市花 月季","大连 市花 槐花","鞍山 市树 南果梨","鞍山 市花 金银花","鞍山 市树 国槐","长春 市树 黑松","长春 市花 君子兰","吉林 市树 垂柳","吉林 市花 玫瑰",
				"哈尔滨 市树 榆树","哈尔滨 市花 丁香","大庆 市树 刺桐树","大庆 市花 刺桐花","西安 市树 国槐","西安 市花 石榴","西安 市花 月季","咸阳 市树 国槐","咸阳 市花 紫薇",
				"咸阳 市树 垂柳","咸阳 市花 月季","渭南 市树 国槐","渭南 市花 月季","兰州 市树 国槐","兰州 市花 玫瑰","银川 市树 国槐","银川 市花 玫瑰",
				"西宁 市树 柳树","西宁 市花 丁香","乌鲁木齐 市树 大叶榆","乌鲁木齐 市花 玫瑰","重庆 市树 黄葛树","重庆 市花 川茶花","成都 市树 银杏","成都 市花 木芙蓉",
				"贵阳 市树 竹子","贵阳 市花 兰花","贵阳 市树 樟树","贵阳 市花 紫薇","遵义 市树 桂花树","遵义 市花 映山红","昆明 市树 玉兰树","昆明 市花 云南山茶","拉萨 市树 榆树","拉萨 市花 翠菊",
				"拉萨 市树 侧柏","拉萨 市花 格桑花","上海 市树 梧桐","上海 市花 白玉兰","南京 市树 雪松","南京 市花 梅花","无锡 市树 香樟","无锡 市花 梅花",
				"无锡 市花 杜鹃","徐州 市树 银杏","徐州 市花 紫薇","常州 市树 广玉兰","常州 市花 月季","苏州 市树 香樟","苏州 市花 桂花",
				"南通 市树 广玉兰","南通 市花 菊花","淮安 市树 雪松","淮安 市花 月季","盐城 市树 女贞","盐城 市花 紫薇","盐城 市树 银杏","盐城 市花 牡丹",
				"扬州 市树 银杏","扬州 市花 琼花","扬州 市树 柳树","镇江 市树 广玉兰","镇江 市花 杜鹃","泰州 市树 银杏","泰州 市花 梅花","宿迁市 市树 槐树","宿迁市 市花 月季",
				"台州 市树 香樟","台州 市花 桂花","杭州 市树 香樟","杭州 市花 桂花","宁波 市树 樟树","宁波 市花 茶花","温州 市树 榕树","温州 市花 茶花",
				"嘉兴 市树 香樟","嘉兴 市花 石榴","嘉兴 市花 杜鹃","绍兴 市树 香榧树","绍兴 市花 兰花","金华 市树 樟树　","金华 市花 山茶花","湖州 市树 银杏","湖州 市花 百合",
				"合肥 市树 广玉兰","合肥 市花 桂花","合肥 市树 ","合肥 市花 石榴","安庆 市树 香樟　","安庆 市花 月季","福州 市树 榕树","福州 市花 茉莉","厦门 市树 凤凰树","厦门 市花 三角梅",
				"泉州 市树 刺桐","泉州 市花 刺桐花","漳州 市树 香樟","漳州 市花 水仙花","漳州 市树 相思树","漳州 市花 ","南昌 市树 香樟","南昌 市花 月季",
				"南昌 市树 ","南昌 市花 金边瑞香","九江 市树 樟树","九江 市花 荷花","上饶 市树 香樟","上饶 市花 杜鹃","吉安 市树 樟树","吉安 市花 杜鹃",
				"赣州 市树 榕树","赣州 市花 杜鹃","济南 市树 柳树","济南 市花 荷花","青岛 市树 雪松","青岛 市花 耐冬","青岛 市树 ","青岛 市花 月季","淄博 市树 国槐","淄博 市花 月季","淄博 市树 法桐","淄博 市花 ",
				"烟台 市树 国槐","烟台 市花 紫薇","菏泽 市树 木瓜树","菏泽 市花 牡丹","威海 市树 合欢","威海 市花 桂花","济宁 市树 国槐","济宁 市花 月季","济宁 市花 荷花",
				"泰安 市树 国槐","泰安 市花 紫薇","德州 市树 枣树","德州 市花 菊花","潍坊 市树 国槐","潍坊 市花 月季","临沂 市树 银杏树","临沂 市花 海棠花",
				"郑州 市树 法国梧桐","郑州 市花 月季","洛阳 市花 牡丹","新乡 市树 国槐","新乡 市花 石榴","焦作 市树 国槐","焦作 市花 月季",
				"南阳 市花 桂花","武汉 市树 水杉","武汉 市花 梅花","襄樊 市树 女贞","襄樊 市花 紫薇","宜昌 市树 柑橘","宜昌 市花 月季",
				"长沙 市树 樟树","长沙 市花 杜鹃","衡阳 市树 香樟","衡阳 市花 月季","衡阳 市花 茶花","岳阳 市树 杜英","岳阳 市花 栀子花","常德 市树 香樟","常德 市花 栀子花",
				"广州 市树 木棉树","广州 市花 木棉花","深圳 市树 荔枝","深圳 市花 簕杜鹃","深圳 市树 红树","深圳 市花 三角梅",
				"珠海 市树 红花紫荆","珠海 市花 簕杜鹃","珠海 市花 三角梅","佛山 市树 白玉","佛山 市花 玫瑰","江门 市树 蒲葵","江门 市花 宝巾","江门 市花 三角梅",
				"湛江 市花 紫荆","惠州 市树 红花紫荆","惠州 市花 宝巾","惠州 市花 三角梅","东莞 市树 荔枝树","东莞 市花 白玉兰","茂名 市花 大红花",
				"南宁 市树 扁桃树","南宁 市花 朱槿","南宁 市花 扶桑","桂林 市树 桂树","桂林 市花 桂花","海口 市树 椰树","海口 市花 三叶梅","海口 市花 三角梅"	
		};
		*/
		
		/**城市市歌	*/
		String projectName = "城市市歌";
		String[] citys = {
				"北京","成都","大连","福州","广州",
				"哈尔滨","杭州","昆明","青岛","青岛",
				"厦门","沈阳","石家庄","武汉","长春",
				"泉州","徐州","苏州","无锡","扬州",
				"包头","烟台","南京","淮安","南通",
				"常州","盐城","绍兴","温州","济宁",
				"临沂","泰州","镇江","嘉兴","台州",
				"宜昌","襄阳","南阳","安庆","常德",
				"吉林","九江","新乡","宿迁","湛江",
				"漳州","珠海"
			};
		String[] keywords = {
				"北京欢迎你 市歌","I LOVE THIS CITY 市歌","大连之恋 市歌","幸福之州 市歌","广州之歌 市歌",
				"在太阳岛上 市歌","梦想天堂 市歌","浪漫昆明 市歌","心随帆动 市歌","帆的故乡 市歌",
				"鼓浪屿之歌 市歌","阳光传奇 市歌","飞翔石家庄 市歌","武汉之歌 市歌","我们在长春相遇 市歌",
				"蓝蓝泉州湾 市歌","一饮尽千钟 市歌","苏州好风光 市歌","太湖美 市歌","茉莉花 市歌",
				"包头是我家、我从草原来 市歌","芝罘岛 市歌","我心中的城 市歌","香溢淮安 市歌","水墨南通 市歌",
				"常州甜白酒 市歌","盐城 市歌","水乡吟 市歌","会飞的家乡 市歌","济宁之歌 市歌",
				"我的家乡我的歌 市歌","故乡最吉祥 市歌","大江东去 市歌","为爱起航 市歌","台州之歌 市歌",
				"宜昌，我的家乡 市歌","梦襄阳 市歌","南阳，我的家乡 市歌","家在龙山风水 市歌","印象常德 市歌",
				"美丽吉林 市歌","九江流在心上 市歌","新乡明天更辉煌 市歌","清清骆马湖 市歌","湛江港之歌 市歌",
				"漳州市我家 市歌","浪漫之城 市歌"
		};
	
		
		 /** 地方特产 
		String projectName = "地方特产";
		String[] citys = {
				"安庆","保定","北京","沧州", "常德","常州","成都","大连","德州","东莞",
				"佛山","福州","赣州","广州","贵阳","哈尔滨","海口","邯郸","杭州","合肥",
				"菏泽","衡阳","呼和浩特","湖州","淮安","惠州","吉安","吉林","济南","济宁",
				"嘉兴","江门","焦作","金华","九江","昆明","拉萨","兰州","聊城","临沂",
				"洛阳","茂名","南昌","南京","南宁","南通","南阳","宁波","青岛","泉州",
				"厦门","上海","上饶","绍兴","深圳","沈阳","石家庄","苏州","台州","太原",
				"泰安","唐山","天津","威海","潍坊","渭南","温州","乌鲁木齐","无锡","武汉",
				"西安","西宁","咸阳","襄阳","新乡","宿迁","徐州","烟台","盐城","扬州","宜昌",
				"银川","岳阳","运城","湛江","漳州","长春","长沙","镇江","郑州","重庆",
				"周口","珠海","淄博","遵义","桂林","鞍山","大庆","泰州","包头"
		};
		String[] keywords = {
				"安庆特产","保定特产","北京特产","沧州特产", "常德特产","常州特产","成都特产","大连特产","德州特产","东莞特产",
				"佛山特产","福州特产","赣州特产","广州特产","贵阳特产","哈尔滨特产","海口特产","邯郸特产","杭州特产","合肥特产",
				"菏泽特产","衡阳特产","呼和浩特特产","湖州特产","淮安特产","惠州特产","吉安特产","吉林特产","济南特产","济宁特产",
				"嘉兴特产","江门特产","焦作特产","金华特产","九江特产","昆明特产","拉萨特产","兰州特产","聊城特产","临沂特产",
				"洛阳特产","茂名特产","南昌特产","南京特产","南宁特产","南通特产","南阳特产","宁波特产","青岛特产","泉州特产",
				"厦门特产","上海特产","上饶特产","绍兴特产","深圳特产","沈阳特产","石家庄特产","苏州特产","台州特产","太原特产",
				"泰安特产","唐山特产","天津特产","威海特产","潍坊特产","渭南特产","温州特产","乌鲁木齐特产","无锡特产","武汉特产",
				"西安特产","西宁特产","咸阳特产","襄阳特产","新乡特产","宿迁特产","徐州特产","烟台特产","盐城特产","扬州特产","宜昌特产",
				"银川特产","岳阳特产","运城特产","湛江特产","漳州特产","长春特产","长沙特产","镇江特产","郑州特产","重庆特产",
				"周口特产","珠海特产","淄博特产","遵义特产","桂林特产","鞍山特产","大庆特产","泰州特产","包头特产"
		};
		*/
		for(int i = 0 ;i <citys.length ; i++ ){
			new BaiduWebSiteProducer(projectName, citys[i], keywords[i]).run();
		}
	}
}
